backend/test/artillery/output.txt
Summary report @ 02:57:30(+0200)
--------------------------------

http.codes.200: ................................................................ 1000
http.codes.429: ................................................................ 2000
http.downloaded_bytes: ......................................................... 96000
http.request_rate: ............................................................. 308/sec
http.requests: ................................................................. 3000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 270
  mean: ........................................................................ 9.5
  median: ...................................................................... 1
  p95: ......................................................................... 79.1
  p99: ......................................................................... 135.7
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 270
  mean: ........................................................................ 24.2
  median: ...................................................................... 3
  p95: ......................................................................... 127.8
  p99: ......................................................................... 144
http.response_time.4xx:
  min: ......................................................................... 0
  max: ......................................................................... 44
  mean: ........................................................................ 2.1
  median: ...................................................................... 1
  p95: ......................................................................... 7
  p99: ......................................................................... 30.9
http.responses: ................................................................ 3000
vusers.completed: .............................................................. 3000
vusers.created: ................................................................ 3000
vusers.created_by_name.0: ...................................................... 3000
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.1
  max: ......................................................................... 292
  mean: ........................................................................ 11.4
  median: ...................................................................... 2.6
  p95: ......................................................................... 83.9
  p99: ......................................................................... 138.4